In [2]:
import pandas as pd

In [ ]:
# 2 main pandas structures

#Series
#dataframes

In [4]:
#SERIES

import pandas as pd
data= [10,20,30,40]

series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
import pandas as pd

data = ['Tanaji', 'More', "Jaipur"]

series = pd.Series(data)
print(series)

0    Tanaji
1      More
2    Jaipur
dtype: str

In [7]:
#Data Frames

import pandas as pd

data = {
    "Name": ["Tanaji", "Amit", "Sidhu"],
    "Age": [22,23,21],
    "City": ["Pune", "Mumbai", "Sangola"]
}

df = pd.DataFrame(data)
print(df)

     Name  Age     City
0  Tanaji   22     Pune
1    Amit   23   Mumbai
2   Sidhu   21  Sangola

In [11]:
# Read CSV File (MOST USED)

import pandas as pd

df = pd.read_csv("data.csv")

print(df)

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
3  Yogesh   30   20400
4    Akki   21   45990
5   Sidhu   24  100000
6    Joan   24   34500
7    Mike   45   55000
8    Cena   34   45000

In [21]:
# View Data
#first 5 rows

import pandas as pd

df = pd.read_csv("data.csv")

df.head() # first 5 record

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
3  Yogesh   30   20400
4    Akki   21   45990

In [22]:
df.tail()

    Name  Age  Salary
4   Akki   21   45990
5  Sidhu   24  100000
6   Joan   24   34500
7   Mike   45   55000
8   Cena   34   45000

In [23]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='str')

In [25]:
df.describe()

             Age         Salary
count   9.000000       9.000000
mean   29.000000   51765.555556
std     7.193747   21735.441743
min    21.000000   20400.000000
25%    24.000000   45000.000000
50%    28.000000   50000.000000
75%    30.000000   55000.000000
max    45.000000  100000.000000

In [26]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      str
 1   Age     9 non-null      int64
 2   Salary  9 non-null      int64
dtypes: int64(2), str(1)
memory usage: 348.0 bytes

In [ ]:
df["Name"] # Single column

0    Tanaji
1     Rahul
2      Amit
3    Yogesh
4      Akki
5     Sidhu
6      Joan
7      Mike
8      Cena
Name: Name, dtype: str

In [31]:

#Multiple columns
df[["Name","Age"]]

     Name  Age
0  Tanaji   25
1   Rahul   30
2    Amit   28
3  Yogesh   30
4    Akki   21
5   Sidhu   24
6    Joan   24
7    Mike   45
8    Cena   34

In [34]:
# Select Rows - Specific

df.loc[2]

Name       Amit
Age          28
Salary    55000
Name: 2, dtype: object

In [35]:
df.loc[0:2]

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000

In [39]:
#Filter Data (VERY IMPORTANT)

df[df['Salary'] >= 50000]

     Name  Age  Salary
0  Tanaji   25   50000
1   Rahul   30   60000
2    Amit   28   55000
5   Sidhu   24  100000
7    Mike   45   55000

In [41]:
#Add New Column

df["Bonus"] = df["Salary"] * 0.10
print(df)

     Name  Age  Salary    Bonus
0  Tanaji   25   50000   5000.0
1   Rahul   30   60000   6000.0
2    Amit   28   55000   5500.0
3  Yogesh   30   20400   2040.0
4    Akki   21   45990   4599.0
5   Sidhu   24  100000  10000.0
6    Joan   24   34500   3450.0
7    Mike   45   55000   5500.0
8    Cena   34   45000   4500.0

In [43]:
# Basic Analysis
# Average salary
df["Salary"].mean()

np.float64(51765.555555555555)

In [44]:
# Maximum salary
df["Salary"].max()

np.int64(100000)

In [59]:
import pandas as pd
# Read file
df = pd.read_csv("employees.csv")
print(df)

# Show first 3 rows
print(df[0:3])

# Show only Name and Salary columns
print(df[['Name','Salary']])

#Avg salary
df["Salary"].mean()

#Filter employees with Salary > 52000
df[df["Salary"] >52000]

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
3   Priya   27   52000    Pune
     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   28   55000   Delhi
     Name  Salary
0  Tanaji   50000
1   Rahul   60000
2    Amit   55000
3   Priya   52000

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   28   55000   Delhi

In [61]:
import pandas as pd

data = {
    "Name":["Tanaji", "Rahul", "Amit", "Priya", "Sidhu"],
    "Age":[25, 30, 32, 45, 22],
    "Salary":[50000, 60000, 55000, 40000, 80000],
    "City":["Pune", "Mumbai", "Jaipur", "Delhi", "Pune"]
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai
2    Amit   32   55000  Jaipur
3   Priya   45   40000   Delhi
4   Sidhu   22   80000    Pune

In [76]:
# 1Ô∏è‚É£ Print the entire DataFrame

df.head(2)

     Name  Age  Salary    City
0  Tanaji   25   50000    Pune
1   Rahul   30   60000  Mumbai

In [77]:
df.tail(2)

    Name  Age  Salary   City
3  Priya   45   40000  Delhi
4  Sidhu   22   80000   Pune

In [70]:
# 4Ô∏è‚É£ Print column names
df.columns

Index(['Name', 'Age', 'Salary', 'City'], dtype='str')

In [71]:
# 5Ô∏è‚É£ Print basic information of DataFrame
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      str
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
 3   City    5 non-null      str
dtypes: int64(2), str(2)
memory usage: 292.0 bytes

In [72]:
# 6Ô∏è‚É£ Select only "Name" column
df['Name']

0    Tanaji
1     Rahul
2      Amit
3     Priya
4     Sidhu
Name: Name, dtype: str

In [73]:
# 7Ô∏è‚É£ Select only "Salary" column
df["Salary"]

0    50000
1    60000
2    55000
3    40000
4    80000
Name: Salary, dtype: int64

In [75]:
# 9Ô∏è‚É£ Print data type of each column
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      str
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
 3   City    5 non-null      str
dtypes: int64(2), str(2)
memory usage: 292.0 bytes

In [78]:
# üîü Print only "Age" column values
df[["Name", "City"]]

     Name    City
0  Tanaji    Pune
1   Rahul  Mumbai
2    Amit  Jaipur
3   Priya   Delhi
4   Sidhu    Pune

In [79]:
df.dtypes

Name        str
Age       int64
Salary    int64
City        str
dtype: object

In [81]:
df["Age"].values

array([25, 30, 32, 45, 22])

In [82]:
df.loc[0]

Name      Tanaji
Age           25
Salary     50000
City        Pune
Name: 0, dtype: object

In [83]:
df.loc[1]

Name       Rahul
Age           30
Salary     60000
City      Mumbai
Name: 1, dtype: object

In [86]:
df.loc[1:3]

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   32   55000  Jaipur
3  Priya   45   40000   Delhi

In [88]:
df.loc[0, "Name"]

'Tanaji'

In [89]:
df.loc[3, "Salary"]

np.int64(40000)

In [90]:
df["Age"].mean()

np.float64(30.8)

In [93]:
df["Salary"].min()

np.int64(40000)

In [94]:
len(df)

5

In [95]:
df.shape[0]

5

In [96]:
df.shape[1]

4

In [98]:
df[df["Age"]<17]

Empty DataFrame
Columns: [Name, Age, Salary, City]
Index: []

In [99]:
df[df["Salary"]>52000]

    Name  Age  Salary    City
1  Rahul   30   60000  Mumbai
2   Amit   32   55000  Jaipur
4  Sidhu   22   80000    Pune

In [100]:
df[df["City"] =="Pune"]

     Name  Age  Salary  City
0  Tanaji   25   50000  Pune
4   Sidhu   22   80000  Pune

In [101]:
df[df["Age"] < 30]

     Name  Age  Salary  City
0  Tanaji   25   50000  Pune
4   Sidhu   22   80000  Pune

In [102]:
df[df["Salary"] == 55000]

   Name  Age  Salary    City
2  Amit   32   55000  Jaipur

In [107]:
# Create Age_after_5_years

df["Age_after_5_years"] = df["Age"] +5
print(df)

     Name  Age  Salary    City  Age_after_5_years Country
0  Tanaji   25   50000    Pune                 30   India
1   Rahul   30   60000  Mumbai                 35   India
2    Amit   32   55000  Jaipur                 37   India
3   Priya   45   40000   Delhi                 50   India
4   Sidhu   22   80000    Pune                 27   India

In [106]:
df["Country"] = "India"
print(df)

     Name  Age  Salary    City  Age_after_5_years Country
0  Tanaji   25   50000    Pune                 30   India
1   Rahul   30   60000  Mumbai                 35   India
2    Amit   32   55000  Jaipur                 37   India
3   Priya   45   40000   Delhi                 50   India
4   Sidhu   22   80000    Pune                 27   India

In [110]:
# Handling Missing values

data= {
    "Name": ["Tanaji", "Rahul", "Amit", "Priya", "Neha"],
    "Age": [25, 30, None, 27, 29],
    "Salary": [50000, 60000, 55000, None, 52000],
    "City": ["Pune", "Mumbai", "Delhi", "Pune", None]
}

df = pd.DataFrame(data)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   NaN  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0     NaN

In [111]:
# üü¢ 1. Handling Missing Values

df.isnull()

    Name    Age  Salary   City
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3  False  False    True  False
4  False  False   False   True

In [112]:
# Count missing values
df.isnull().sum()

Name      0
Age       1
Salary    1
City      1
dtype: int64

In [113]:
# Remove rows with missing values

df_clean = df.dropna()
print(df_clean)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai

In [117]:
df["Age"] = df["Age"].fillna(0)
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   0.0  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0     NaN

In [ ]:
df["City"] = df["City"].fillna("Unkown")
print(df)

     Name   Age   Salary    City
0  Tanaji  25.0  50000.0    Pune
1   Rahul  30.0  60000.0  Mumbai
2    Amit   0.0  55000.0   Delhi
3   Priya  27.0      NaN    Pune
4    Neha  29.0  52000.0       0